In [2]:
%load_ext autoreload
%autoreload 2

## Evaluation Criteria
- The import of data into the database should work correctly
- The implemented functionality/queries should work correctly as desribed by problem text
- The implemented functionality/queries should be clear and easy to understand
- The efficiency of the code is not considered as an evaluation criteria in this exercise
- The connection to programming language should be clear and easy to understand
- The code should be implemented by the group members and for this exercise, i.e. copying code from
  others or by the use of AI tools (CoPilot, ChatGPT and similar) is considered as cheating
- Clear and understandable report as described by the problem text

In [3]:
import database
import pandas as pd
pd.options.display.float_format = "{:,.2f}".format

In [4]:
db_conn = database.CustomDbConnector()

You are connected to the database: mongo
-----------------------------------------------

## Part 1, import

In [5]:
import importer

In [6]:
imprt = importer.Importer(db_conn.db)

In [11]:
imprt.import_with_backreferences()

----------------------Starting import_with_backreferences-----------------------
----------------------------Starting import_user_df-----------------------------
----------------------Finished import_user_df in 4.314 ms-----------------------

-----------------Starting import_activities_and_track_points_df-----------------

/Users/larswaage/Code/large-distributed-data/src/mongodb/importer.py:211: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  curr_tps_df = pd.read_csv(

--------Finished import_activities_and_track_points_df in 123859.778 ms---------

--------------------------Starting create_collections---------------------------
--------------------Finished create_collections in 55.259 ms--------------------

Importing users
Importing activities
Importing track points
Adding indices
add spatial index for location on track_points
Add index for activity_id on track_points
Add index for datetime on track_points
Finished adding indices
--------------Finished import_with_backreferences in 334663.678 ms--------------

### Samples

In [12]:
imprt.user_sample()

------------------------------Starting user_sample------------------------------
------------------------Finished user_sample in 25.19 ms------------------------

   _id  has_labels                                         activities
0    0       False  [653a6c83db0274949d123563, 653a6c83db0274949d1...
1    1       False  [653a6c84db0274949d1235fe, 653a6c84db0274949d1...
2    2       False  [653a6c84db0274949d123637, 653a6c84db0274949d1...
3    3       False  [653a6c85db0274949d1236c9, 653a6c85db0274949d1...
4    4       False  [653a6c87db0274949d1237ce, 653a6c87db0274949d1...
5    5       False  [653a6c88db0274949d123928, 653a6c89db0274949d1...
6    6       False  [653a6c89db0274949d123971, 653a6c89db0274949d1...
7    7       False  [653a6c89db0274949d123989, 653a6c89db0274949d1...
8    8       False  [653a6c89db0274949d1239b1, 653a6c89db0274949d1...
9    9       False  [653a6c89db0274949d1239c8, 653a6c89db0274949d1...

In [13]:
imprt.activity_sample()

----------------------------Starting activity_sample----------------------------
---------------------Finished activity_sample in 10.996 ms----------------------

,_id,user_id,start_datetime,end_datetime,transportation_mode,track_points
0,653a6c83db0274949d123563,0,2009-04-12 07:33:03,2009-04-12 17:24:59,,"[653a6cdcdb0274949d127413, 653a6cdcdb0274949d1..."
1,653a6c83db0274949d123564,0,2009-05-10 02:02:06,2009-05-10 06:20:11,,"[653a6cdcdb0274949d127aed, 653a6cdcdb0274949d1..."
2,653a6c83db0274949d123565,0,2008-12-01 11:18:27,2008-12-01 11:35:15,,"[653a6cdcdb0274949d127e1e, 653a6cdcdb0274949d1..."
3,653a6c83db0274949d123566,0,2009-06-21 10:14:07,2009-06-21 14:47:12,,"[653a6cdcdb0274949d127ed5, 653a6cdcdb0274949d1..."
4,653a6c83db0274949d123567,0,2008-12-11 12:14:32,2008-12-11 12:24:32,,"[653a6cdcdb0274949d12861d, 653a6cdcdb0274949d1..."
5,653a6c83db0274949d123568,0,2009-06-29 01:16:30,2009-06-29 11:13:12,,"[653a6cdcdb0274949d128696, 653a6cdcdb0274949d1..."
6,653a6c83db0274949d123569,0,2009-05-09 18:16:36,2009-05-09 18:30:36,,"[653a6cdcdb0274949d128e58, 653a6cdcdb0274949d1..."
7,653a6c83db0274949d12356a,0,2009-07-03 00:28:00,2009-07-03 08:37:23,,"[653a6cdcdb0274949d128f05, 653a6cdcdb0274949d1..."
8,653a6c83db0274949d12356b,0,2009-06-07 07:52:55,2009-06-07 09:46:03,,"[653a6cdcdb0274949d129601, 653a6cdcdb0274949d1..."
9,653a6c83db0274949d12356c,0,2009-06-11 22:12:04,2009-06-11 22:34:54,,"[653a6cdcdb0274949d129887, 653a6cdcdb0274949d1..."

In [14]:
imprt.track_point_sample()

--------------------------Starting track_point_sample---------------------------
--------------------Finished track_point_sample in 7.612 ms---------------------

,_id,datetime,altitude,location,activity_id,user_id,transportation_mode
0,653a6cdcdb0274949d127413,2009-04-12 07:33:03,105.00,"{'type': 'Point', 'coordinates': [116.327479, ...",653a6c83db0274949d123563,000,
1,653a6cdcdb0274949d127414,2009-04-12 07:33:09,80.00,"{'type': 'Point', 'coordinates': [116.327474, ...",653a6c83db0274949d123563,000,
2,653a6cdcdb0274949d127415,2009-04-12 07:33:14,99.00,"{'type': 'Point', 'coordinates': [116.327454, ...",653a6c83db0274949d123563,000,
3,653a6cdcdb0274949d127416,2009-04-12 07:33:19,109.00,"{'type': 'Point', 'coordinates': [116.327407, ...",653a6c83db0274949d123563,000,
4,653a6cdcdb0274949d127417,2009-04-12 07:33:24,111.00,"{'type': 'Point', 'coordinates': [116.327281, ...",653a6c83db0274949d123563,000,
5,653a6cdcdb0274949d127418,2009-04-12 07:33:29,114.00,"{'type': 'Point', 'coordinates': [116.327285, ...",653a6c83db0274949d123563,000,
6,653a6cdcdb0274949d127419,2009-04-12 07:33:34,120.00,"{'type': 'Point', 'coordinates': [116.327267, ...",653a6c83db0274949d123563,000,
7,653a6cdcdb0274949d12741a,2009-04-12 07:33:39,125.00,"{'type': 'Point', 'coordinates': [116.327165, ...",653a6c83db0274949d123563,000,
8,653a6cdcdb0274949d12741b,2009-04-12 07:33:44,126.00,"{'type': 'Point', 'coordinates': [116.326997, ...",653a6c83db0274949d123563,000,
9,653a6cdcdb0274949d12741c,2009-04-12 07:33:49,127.00,"{'type': 'Point', 'coordinates': [116.326873, ...",653a6c83db0274949d123563,000,

## Part 2, tasks

### Setup

In [8]:
import tasks
task = tasks.Task(db_conn.db)

### Task 1

In [16]:
t1 = task.task1()
t1

---------------------------------Starting task1---------------------------------
-------------------------Finished task1 in 2449.941 ms--------------------------

   # users  # activities  # track points
0      182         16048         9681756

### Task 2

In [17]:
t2 = task.task2()
t2

---------------------------------Starting task2---------------------------------
---------------------------Finished task2 in 3.622 ms---------------------------

   avg_activity_count
0               88.18

### Task 3

In [18]:
t3 = task.task3()
t3

---------------------------------Starting task3---------------------------------
---------------------------Finished task3 in 2.663 ms---------------------------

    activity_count  user_id
0             2102      128
1             1793      153
2              715       25
3              704      163
4              691       62
5              563      144
6              399       41
7              364       85
8              346        4
9              345      140
10             320      167
11             280       68
12             265       17
13             261        3
14             236       14
15             215      126
16             210       30
17             208      112
18             201       11
19             198       39

### Task 4

In [19]:
t4 = task.task4()
t4

---------------------------------Starting task4---------------------------------
---------------------------Finished task4 in 9.18 ms----------------------------

   Users Who Have Taken a Taxi
0                           10
1                           58
2                           62
3                           78
4                           80
5                           85
6                           98
7                          111
8                          128
9                          163

### Task 5

In [20]:
t5 = task.task5()
t5

---------------------------------Starting task5---------------------------------
---------------------------Finished task5 in 7.162 ms---------------------------

        _id  transportation_mode_count
0      walk                        481
1       car                        419
2      bike                        262
3       bus                        199
4    subway                        133
5      taxi                         37
6  airplane                          3
7     train                          2
8       run                          1
9      boat                          1

### Task 6

#### Task 6a

In [21]:
t6a = task.task6a()
t6a

--------------------------------Starting task6a---------------------------------
--------------------------Finished task6a in 15.987 ms--------------------------

   activityCount  year
0           5895  2008

#### Task 6b

In [9]:
t6b = task.task6b()
t6b

--------------------------------Starting task6b---------------------------------
-------------------------Finished task6b in 157.431 ms--------------------------

   totalHours  year
0       11636  2009

### Task 7

In [23]:
t7 = task.task7()
t7

---------------------------------Starting task7---------------------------------
-------------------------Finished task7 in 2009.171 ms--------------------------

   Total Distance Walked by User 112 in 2008 (km)
0                                          115.60

### Task 8

In [24]:
t8 = task.task8()
t8

---------------------------------Starting task8---------------------------------
Fetching track points
Loading into DataFrame
Calculating the change in altitude between track points
Comparing activity_ids
Create filter for positive Δ altitude
Create filter for positive Δ altitude and same activity
Summing the total altitude gain, grouped by user
Sorting by total meters gained, descending
------------------------Finished task8 in 108363.712 ms-------------------------

      id  total meters gained per user
126  128                  2,135,669.28
147  153                  1,820,736.95
4    004                  1,089,358.00
41   041                    789,924.10
3    003                    766,613.00
84   085                    714,053.10
155  163                    673,472.34
61   062                    596,106.60
140  144                    588,718.91
30   030                    576,377.00
39   039                    481,311.00
83   084                    430,319.00
0    000                    398,638.00
2    002                    377,503.00
159  167                    370,650.11
25   025                    358,131.80
37   037                    325,572.80
137  140                    311,175.52
124  126                    272,394.47
17   017                    205,319.40

### Task 9

In [25]:
t9 = task.task9()
t9.head(20)

---------------------------------Starting task9---------------------------------
Fetching track points
Loading into DataFrame
Convert datetime to datetime
Find time diff
Find indices where time diff exceeds 5 minutes
Find indices where activity id is equal to the previous index
Find indices where activity id is the same as the previous index AND the time difference exceeds 5 minutes
Find all invalid track points
Drop duplicates on activity id
Group by user and count the number of activity ids
-------------------------Finished task9 in 92270.862 ms-------------------------

         # Invalid Activities
user_id
000                       101
001                        45
002                        98
003                       179
004                       219
005                        44
006                        17
007                        30
008                        16
009                        31
010                        50
011                        32
012                        43
013                        29
014                       118
015                        46
016                        20
017                       129
018                        27
019                        31

### Task 10

In [26]:
t10 = task.task10()
t10

--------------------------------Starting task10---------------------------------
-------------------------Finished task10 in 7185.134 ms-------------------------

   Users in the Forbidden City
0                          004
1                          018
2                          019
3                          025
4                          052
5                          062
6                          119
7                          128
8                          131
9                          136
10                         140
11                         144
12                         153
13                         163
14                         168
15                         169

### Task 11

In [27]:
t11 = task.task11()
t11

--------------------------------Starting task11---------------------------------
-------------------------Finished task11 in 526.229 ms--------------------------

    user_id most_used_transportation_mode  transportation_mode_count
0        10                          taxi                          3
1        20                          bike                         80
2        21                          walk                          1
3        52                           bus                          1
4        56                          bike                         15
5        58                           car                          2
6        60                          walk                          1
7        62                           bus                        173
8        64                          bike                          1
9        65                          bike                         10
10       67                          walk                          1
11       69                          bike                          1
12       73                          walk                         52
13       75                          walk                          1
14       76                           car                          3
15       78                          walk                         37
16       80                          taxi                          1
17       81                          bike                          4
18       82                          walk                          2
19       84                          walk                          9
20       85                          walk                         18
21       86                           car                          2
22       87                          walk                          5
23       89                           car                          7
24       91                           bus                          2
25       92                          walk                          1
26       97                          bike                          9
27       98                          taxi                          1
28      101                           car                          3
29      102                          bike                          7
30      107                          walk                          1
31      108                          walk                          2
32      111                          taxi                          3
33      112                          walk                         69
34      115                           car                         80
35      117                          walk                          1
36      125                          bike                          3
37      126                          bike                         13
38      128                           car                        312
39      136                          walk                          3
40      138                          bike                          2
41      139                          bike                          4
42      144                          walk                          2
43      153                          walk                          5
44      161                          walk                          1
45      163                          bike                         26
46      167                          bike                         31
47      175                           bus                          1